# SetLayerDeltaZOffset

## Description
_Vectorworks 2012 Deprecated Functions_. See architectural category for replacement:
:DelObjStoryBound
:DelObjStoryBounds
:GetObjBoundElevation
:GetObjStoryBound
:GetObjStoryBoundsAt
:GetObjStoryBoundsCnt
:GetStoryLayerInfo
:HasObjStoryBound
:HasObjStoryBounds
:SetObjectStoryBound

Sets the wall height's offset to the layer delta z.

```pascal
FUNCTION SetLayerDeltaZOffset(
				theWall           : HANDLE;
				layerDeltaZOffset : REAL): BOOLEAN;
```

```python
def vs.SetLayerDeltaZOffset(theWall, layerDeltaZOffset):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|theWall|HANDLE|The wall.|
|layerDeltaZOffset|REAL|The wall height's offset to the layer delta z.|

## Examples
```pascal
resultOK := SetLayerDeltaZOffset(theWall, 1.0);
```
```python
import vs

# _Vectorworks 2012 Deprecated Functions_.
theWall = vs.FSActLayer()  # handle to the first selected object on the active layer
layerDeltaZOffset = 0.0

ok = vs.SetLayerDeltaZOffset(theWall, layerDeltaZOffset)
if ok:
    vs.Message('SetLayerDeltaZOffset succeeded')
else:
    vs.Message('SetLayerDeltaZOffset failed')
```

## See Also
VS Functions:
GetLayerDeltaZOffset

## Version
Availability: from VectorWorks12.5
Deprecated: Vectorworks 2012 Deprecated Functions

## Category
* Objects - Walls